cfmeshJet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;//nextWrite;

endTime         20e-6;//0.002;

deltaT         1e-9;

writeControl    adjustableRunTime;

writeInterval  $deltaT;//5e-7;//1e-05;

purgeWrite      0;

writeFormat     binary;

writePrecision  11;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.3;

maxDeltaT       5e-9;


functions
{

    #includeFunc yPlus;
    #includeFunc minMaxMagnitude;
    #includeFunc solverInfo;

};

/*
functions
{    

    residuals
    {
        type           residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled        true;
    writeControl   timeStep;
        writeInterval  1;
        fields
        (
            U
            p
		e
		omega
		k
        );
    }
}; */


libs (
"libDAngolafluidThermophysicalModels.so"
);


// ************************************************************************* //
