cfmeshJet/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;//laminar;//RAS;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;

    printCoeffs     on;
}

LES
{   
    LESModel        Smagorinsky;

    SmagorinskyCoeffs
    {
        Ce              1.048;
        Ck              0.047146967; // Updated to give Cs = 0.1
    }

    delta            cubeRootVol;//vanDriest;
    
    vanDriestCoeffs //Delta= https://www.openfoam.com/documentation/guides/latest/doc/guide-turbulence-les-delta-vandriest.html
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        Aplus           26;
        Cdelta          0.158;
    }
    
    cubeRootVolCoeffs // Delta=c(v)^(1/3)
    {
        // Optional entries

        // Multiplier
        deltaCoeff      1;
    }

    printCoeffs     on;
    turbulence      on;
}
// ************************************************************************* //
