cfmeshJet/constant/thermophysicalProperties

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       DAngola;
    thermo          hDAngola;
    equationOfState DAngolaGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture // air at room temperature (293 K)
{
    specie
    {
        molWeight   28.9;
    }

    thermodynamics
    {
        Cp          1005;
        Hf          0;
        //Href        3e5;
    }

    transport
    {
        mu          0;
        Pr          0.71;
    }
}

// ************************************************************************* //
