cfmeshJet/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            1e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{
    /*"outlet"
    {   
        type            inletOutlet; //maybe fixed values
        inletValue      uniform $pOut;
        value           uniform $pOut;
    }*/

   outlet
   {
        type            totalPressure;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform $pOut;
        value           uniform $pOut;

        // Optional entries
        U               U;
    }
    
    "(plane|container|elec.*)"
    {
        type            zeroGradient;
    }
    //#includeEtc "caseDicts/setConstraintTypes"


}

// ************************************************************************* //
