cfmeshJet/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;//mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-15;

boundaryField
{
    
    "outlet.*"
    {
        type            calculated;
        value           uniform 0;
    }

    "(container|elec.*|plane)"
    {
        type            nutkWallFunction;//fixedValue;
        value           uniform 0;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
